results/gcs_ssd/fio-rw:randrw-rwmixread:33-numjobs:3-iodepth:10-bs:4k.out
fio-rw:randrw-rwmixread:33-numjobs:3-iodepth:10-bs:4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=10
...
fio-3.28
Starting 3 processes
fio-rw:randrw-rwmixread:33-numjobs:3-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:randrw-rwmixread:33-numjobs:3-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:randrw-rwmixread:33-numjobs:3-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)

fio-rw:randrw-rwmixread:33-numjobs:3-iodepth:10-bs:4k: (groupid=0, jobs=3): err= 0: pid=32273: Mon Feb 26 18:27:55 2024
  read: IOPS=4818, BW=18.8MiB/s (19.7MB/s)(5750MiB/305509msec)
    slat (usec): min=188, max=100945, avg=572.91, stdev=686.98
    clat (usec): min=6, max=3113.5k, avg=1831.42, stdev=7177.98
     lat (usec): min=280, max=3114.6k, avg=2405.49, stdev=7214.49
    clat percentiles (usec):
     |  1.00th=[   90],  5.00th=[  553], 10.00th=[  668], 20.00th=[ 1057],
     | 30.00th=[ 1254], 40.00th=[ 1500], 50.00th=[ 1713], 60.00th=[ 1926],
     | 70.00th=[ 2180], 80.00th=[ 2474], 90.00th=[ 2933], 95.00th=[ 3359],
     | 99.00th=[ 4359], 99.50th=[ 5014], 99.90th=[ 7701], 99.95th=[ 8979],
     | 99.99th=[74974]
   bw (  KiB/s): min=  512, max=25720, per=100.00%, avg=19761.81, stdev=853.35, samples=1786
   iops        : min=  128, max= 6430, avg=4940.08, stdev=213.35, samples=1786
  write: IOPS=9782, BW=38.2MiB/s (40.1MB/s)(11.4GiB/305509msec); 0 zone resets
    slat (usec): min=3, max=885, avg= 8.66, stdev= 6.08
    clat (usec): min=58, max=3114.6k, avg=1811.06, stdev=5964.37
     lat (usec): min=63, max=3114.6k, avg=1819.87, stdev=5964.40
    clat percentiles (usec):
     |  1.00th=[   75],  5.00th=[  537], 10.00th=[  652], 20.00th=[ 1045],
     | 30.00th=[ 1237], 40.00th=[ 1500], 50.00th=[ 1696], 60.00th=[ 1909],
     | 70.00th=[ 2180], 80.00th=[ 2474], 90.00th=[ 2933], 95.00th=[ 3326],
     | 99.00th=[ 4359], 99.50th=[ 4948], 99.90th=[ 7701], 99.95th=[ 9110],
     | 99.99th=[76022]
   bw (  KiB/s): min=  840, max=53120, per=100.00%, avg=40121.88, stdev=1794.40, samples=1786
   iops        : min=  210, max=13280, avg=10030.14, stdev=448.62, samples=1786
  lat (usec)   : 10=0.01%, 100=2.29%, 250=0.43%, 500=0.98%, 750=9.05%
  lat (usec)   : 1000=4.88%
  lat (msec)   : 2=45.62%, 4=35.04%, 10=1.67%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.02%, 250=0.01%, >=2000=0.01%
  cpu          : usr=3.26%, sys=9.32%, ctx=1489954, majf=0, minf=65
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1472065,2988781,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: bw=18.8MiB/s (19.7MB/s), 18.8MiB/s-18.8MiB/s (19.7MB/s-19.7MB/s), io=5750MiB (6030MB), run=305509-305509msec
  WRITE: bw=38.2MiB/s (40.1MB/s), 38.2MiB/s-38.2MiB/s (40.1MB/s-40.1MB/s), io=11.4GiB (12.2GB), run=305509-305509msec

Disk stats (read/write):
  sdd: ios=1472065/2448029, merge=0/21, ticks=760655/2809385, in_queue=3570044, util=100.00%